{"program":{"tabs":{"frontend":{"label":"Front End","children":{"library":{"label":"Library","children":{"lodash":{"label":"Lodash","desc":"Lodash is a consistent, modular, high-performance JavaScript utility library."},"rxjs":{"label":"RxJs","desc":"RxJS is a library for composing asynchronous and event-based programs by using observable sequences."},"xstate":{"label":"XState","desc":"XState is a state management and orchestration solution for JavaScript and TypeScript apps."}}},"date":{"label":"Date","children":{"momentjs":{"label":"Moment.js","desc":"Moment.js is a monolithic library, meaning it includes all features in a single package. While it offers a robust set of functionalities, it can lead to larger bundle sizes and is not as modular as the other options, which may be a drawback for performance-sensitive applications."},"dayjs":{"label":"Day.js","desc":"Day.js offers a similar modular approach, enabling developers to include only the features they require. Its core library is very small, and additional functionality can be added through plugins, keeping the bundle size minimal while providing extensibility."},"date-fns":{"label":"Date-fns","desc":"Date-fns is designed with a modular architecture, allowing developers to import only the specific functions they need. This leads to smaller bundle sizes and optimized performance, making it a great choice for applications where minimizing load times is crucial."},"luxon":{"label":"Luxon","desc":"Luxon is less modular compared to date-fns and day.js, as it is a more comprehensive library that includes a wide range of features out of the box. While this can lead to larger bundle sizes, it provides a rich API for handling complex date and time manipulations, making it suitable for applications that require extensive date functionalities."}}},"arithmetic":{"label":"Arithmetic","children":{"mathjs":{"label":"Mathj.s","desc":"Math.js is a full-featured mathematics library that includes arbitrary-precision arithmetic along with a wide range of mathematical functions, including algebra, calculus, and statistics. It is ideal for applications that require both precision and advanced mathematical capabilities."},"bignumberjs":{"label":"Bignumber.js","desc":"Bignumber.js offers a rich set of features for arbitrary-precision arithmetic, including rounding, formatting, and conversion functions. It is suitable for applications that require a comprehensive arithmetic solution."},"decimaljs":{"label":"Decimal.js","desc":"Decimal.js provides advanced decimal arithmetic features, including various rounding modes and precise control over decimal places. It is particularly useful for applications in finance and accounting."},"bigjs":{"label":"Big.js","desc":"Big.js focuses on basic arithmetic operations and provides a simple API for handling large numbers. It is straightforward and easy to use, but lacks advanced mathematical functions."}}},"animation":{"label":"Animation","children":{"animejs":{"label":"Anime.js","desc":"Anime.js is a lightweight JavaScript animation library that works with CSS properties, SVG, DOM attributes, and JavaScript objects. It provides a flexible and powerful API for creating complex animations with ease."},"motion":{"label":"Motion","desc":"Motion is a powerful animation library designed to work seamlessly with React applications. It provides a simple and intuitive API for creating animations and transitions, making it easier for developers to enhance user interfaces with smooth and engaging visual effects."},"gsap":{"label":"GSAP","desc":"GSAP (GreenSock Animation Platform)  is a robust JavaScript library for creating high-performance animations. It is widely used in web development for its powerful features and flexibility. GSAP allows for complex sequencing, timeline control, and fine-tuning of animations, making it suitable for both simple and intricate animationss"}}},"data_visualization":{"label":"Data Visualization","children":{"d3":{"label":"D3","desc":"D3 is a powerful JavaScript library for producing dynamic, interactive data visualizations in web browsers. It leverages the full capabilities of modern web standards such as SVG, HTML, and CSS, allowing developers to create complex visual representations of data. D3 is highly flexible and provides a wide range of tools for data manipulation, binding data to the Document Object Model (DOM), and creating transitions and animations."},"chartjs":{"label":"Chart.js","desc":"Chart.js is a simple yet flexible JavaScript charting library for designers and developers. It provides a variety of pre-built chart types, including line, bar, radar, doughnut, and more. Chart.js is easy to use and offers a straightforward API, making it an excellent choice for those who need to create visualizations quickly without delving into the complexities of D3. It also supports responsive design, ensuring that charts look great on any device."},"echarts":{"label":"Echarts","desc":"Echarts is a comprehensive charting library developed by Baidu. It is known for its rich features and ability to handle large datasets efficiently. ECharts supports a variety of chart types and offers advanced features such as data visualization, animations, and interactive capabilities. It is particularly well-suited for applications that require complex visualizations and real-time data updates."}}},"game":{"label":"Game","children":{"pixijs":{"label":"PixiJS","desc":"PixiJS is a popular 2D rendering library for creating interactive graphics and animations in web applications. It leverages WebGL for high-performance rendering while providing a fallback to HTML5 Canvas for compatibility with older browsers. "},"phaser":{"label":"Phaser","desc":"Phaser is a popular open-source HTML5 game framework that enables developers to create 2D games for web and mobile platforms. With its rich set of features, including a powerful rendering engine, physics systems, input handling, and asset management, Phaser provides a comprehensive toolkit for game development."},"threejs":{"label":"Three.js","desc":"Three.js is a popular JavaScript library used for creating and displaying 3D graphics in a web browser. It leverages WebGL to render high-performance graphics and provides a simple API to work with 3D objects, scenes, cameras, lights, and animations."},"babylonjs":{"label":"Babylon.js","desc":"Babylon.js is powerful 3D engine that allows developers to create stunning graphics and immersive experiences in the browser. It is designed to be user-friendly and provides a comprehensive set of features, including physics, animations, and a rich material system. Babylon.js also supports WebXR, making it a strong candidate for developing virtual reality (VR) and augmented reality (AR) applications."},"orillusion":{"label":"Orillusion","desc":"Orillusion engine is a lightweight rendering engine that fully supports the WebGPU standard. Based on the latest Web graphics API standard, we have made a lot of exploration and attempts to implement many techniques and functions that were previously difficult or impossible to achieve on the web."}}},"vue":{"label":"Vue","children":{"vuejs":{"label":"Vue.js","desc":"The Progressive JavaScript Framework"},"vue_router":{"label":"Vue Router","desc":"The official Router for Vue.js"},"pinia":{"label":"Pinia","desc":"The intuitive store for Vue.js"},"vue_i18n":{"label":"Vue I18n","desc":"Vue I18n is internationalization plugin for Vue.js"},"vueuse":{"label":"VueUse","desc":"Collection of Vue Composition Utilities"},"vite_press":{"label":"VitePress","desc":"Vite & Vue Powered Static Site Generator"},"nuxt":{"label":"Nuxt","desc":"The Intuitive Vue Framework"}}}}}}}}